{"backend": "tensorflow", "config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_3"}, "class_name": "InputLayer", "name": "input_3", "inbound_nodes": []}, {"config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_3"}, "class_name": "InputLayer", "name": "input_3", "inbound_nodes": []}, {"config": {"filters": 16, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "name": "conv2d_8", "bias_constraint": null, "kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pooling2d_4", "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_4", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"config": {"filters": 8, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "name": "conv2d_9", "bias_constraint": null, "kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pooling2d_5", "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_5", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"config": {"filters": 8, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "name": "conv2d_10", "bias_constraint": null, "kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pooling2d_6", "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_6", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"config": {"activation": "relu", "bias_constraint": null, "use_bias": true, "units": 64, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"activation": "sigmoid", "bias_constraint": null, "use_bias": true, "units": 10, "trainable": true, "bias_regularizer": null, "activity_regularizer": {"config": {"l1": 9.999999747378752e-05, "l2": 0.0}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"rate": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "output_layers": [["dropout_2", 0, 0]], "input_layers": [["input_3", 0, 0]], "name": "model_1"}, "class_name": "Model", "name": "model_1", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 10], "name": "input_5"}, "class_name": "InputLayer", "name": "input_5", "inbound_nodes": []}, {"config": {"activation": "relu", "bias_constraint": null, "use_bias": true, "units": 64, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_3", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"config": {"rate": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"config": {"activation": "relu", "bias_constraint": null, "use_bias": true, "units": 128, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_4", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"config": {"rate": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout", "name": "dropout_4", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"config": {"target_shape": [4, 4, 8], "name": "reshape_1", "trainable": true}, "class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4, 4, 8], "name": "input_4"}, "class_name": "InputLayer", "name": "input_4", "inbound_nodes": []}, {"config": {"filters": 8, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_11", "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "name": "up_sampling2d_4", "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_4", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"config": {"filters": 8, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_12", "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "name": "up_sampling2d_5", "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_5", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"config": {"filters": 16, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "name": "conv2d_13", "kernel_regularizer": null, "kernel_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "trainable": true, "name": "up_sampling2d_6", "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_6", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"config": {"filters": 1, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "sigmoid", "name": "conv2d_14", "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["conv2d_14", 0, 0]], "name": "basic_decoder"}, "class_name": "Model", "name": "basic_decoder", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}], "output_layers": [["basic_decoder", 1, 0]], "input_layers": [["input_5", 0, 0]], "name": "model_3"}, "class_name": "Model", "name": "model_3", "inbound_nodes": [[["model_1", 1, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["model_3", 1, 0]], "name": "regz_convolutional_ae"}, "class_name": "Model", "keras_version": "2.0.6"}