{"keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "name": "input_3", "sparse": false}, "name": "input_3"}, {"class_name": "Model", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "name": "input_3", "sparse": false}, "name": "input_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_8", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_8"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "name": "max_pooling2d_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_9", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_9"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_5", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "name": "max_pooling2d_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_10", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_10"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_6", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "name": "max_pooling2d_6"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "units": 64, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null}, "name": "dense_1"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "name": "dropout_1"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "sigmoid", "units": 10, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_2", "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 9.999999747378752e-05}}, "bias_constraint": null}, "name": "dense_2"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "name": "dropout_2"}], "input_layers": [["input_3", 0, 0]], "output_layers": [["dropout_2", 0, 0]], "name": "regularized_convolutional_enc"}, "name": "regularized_convolutional_enc"}, {"class_name": "Model", "inbound_nodes": [[["regularized_convolutional_enc", 1, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 10], "dtype": "float32", "name": "input_5", "sparse": false}, "name": "input_5"}, {"class_name": "Dense", "inbound_nodes": [[["input_5", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "units": 64, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_3", "activity_regularizer": null, "bias_constraint": null}, "name": "dense_3"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}, "name": "dropout_3"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "units": 128, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_4", "activity_regularizer": null, "bias_constraint": null}, "name": "dense_4"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"trainable": true, "name": "dropout_4", "rate": 0.5}, "name": "dropout_4"}, {"class_name": "Reshape", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"trainable": true, "target_shape": [4, 4, 8], "name": "reshape_1"}, "name": "reshape_1"}, {"class_name": "Model", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 4, 4, 8], "dtype": "float32", "name": "input_4", "sparse": false}, "name": "input_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "name": "conv2d_11", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "filters": 8, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_11"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_4"}, "name": "up_sampling2d_4"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "name": "conv2d_12", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "filters": 8, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_12"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_5"}, "name": "up_sampling2d_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "name": "conv2d_13", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "filters": 16, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "valid"}, "name": "conv2d_13"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_6"}, "name": "up_sampling2d_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "name": "conv2d_14", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "filters": 1, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "sigmoid", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_14"}], "input_layers": [["input_4", 0, 0]], "name": "simple_convolutional_dec", "output_layers": [["conv2d_14", 0, 0]]}, "name": "simple_convolutional_dec"}], "input_layers": [["input_5", 0, 0]], "output_layers": [["simple_convolutional_dec", 1, 0]], "name": "regularized_convolutional_dec"}, "name": "regularized_convolutional_dec"}], "input_layers": [["input_3", 0, 0]], "name": "regz_convolutional_ae", "output_layers": [["regularized_convolutional_dec", 1, 0]]}}