{"backend": "tensorflow", "config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"filters": 16, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "name": "conv2d_1", "bias_constraint": null, "kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pooling2d_1", "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"config": {"filters": 8, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pooling2d_2", "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"config": {"filters": 8, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "name": "conv2d_3", "bias_constraint": null, "kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "max_pooling2d_3", "padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}], "output_layers": [["max_pooling2d_3", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "basic_encoder"}, "class_name": "Model", "name": "basic_encoder", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4, 4, 8], "name": "input_2"}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"filters": 8, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "name": "conv2d_4", "bias_constraint": null, "kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "up_sampling2d_1", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"config": {"filters": 8, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "name": "conv2d_5", "bias_constraint": null, "kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "up_sampling2d_2", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"config": {"filters": 16, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "name": "conv2d_6", "bias_constraint": null, "kernel_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "up_sampling2d_3", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "name": "up_sampling2d_3", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"config": {"filters": 1, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "activation": "sigmoid", "name": "conv2d_7", "bias_constraint": null, "kernel_constraint": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}], "output_layers": [["conv2d_7", 0, 0]], "input_layers": [["input_2", 0, 0]], "name": "basic_decoder"}, "class_name": "Model", "name": "basic_decoder", "inbound_nodes": [[["basic_encoder", 1, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["basic_decoder", 1, 0]], "name": "simple_convolutional_ae"}, "class_name": "Model", "keras_version": "2.0.6"}