{"keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "name": "conv2d_1", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "filters": 16, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "name": "conv2d_2", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "filters": 8, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "name": "conv2d_3", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "filters": 8, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "name": "max_pooling2d_3"}], "input_layers": [["input_1", 0, 0]], "name": "simple_convolutional_enc", "output_layers": [["max_pooling2d_3", 0, 0]]}}