{"keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Model", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_1", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_2", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_3", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "padding": "same"}, "name": "max_pooling2d_3"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["max_pooling2d_3", 0, 0]], "name": "simple_convolutional_enc"}, "name": "simple_convolutional_enc"}, {"class_name": "Model", "inbound_nodes": [[["simple_convolutional_enc", 1, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 4, 4, 8], "dtype": "float32", "name": "input_2", "sparse": false}, "name": "input_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_4", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_4"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1"}, "name": "up_sampling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_5", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_5"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2"}, "name": "up_sampling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_6", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "valid"}, "name": "conv2d_6"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3"}, "name": "up_sampling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "config": {"use_bias": true, "kernel_size": [3, 3], "activation": "sigmoid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "conv2d_7", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "padding": "same"}, "name": "conv2d_7"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["conv2d_7", 0, 0]], "name": "simple_convolutional_dec"}, "name": "simple_convolutional_dec"}], "input_layers": [["input_1", 0, 0]], "name": "simple_convolutional_ae", "output_layers": [["simple_convolutional_dec", 1, 0]]}}