{"config": {"output_layers": [["model_2", 1, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["max_pooling2d_3", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 28, 28, 1], "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "padding": "same", "filters": 16, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "padding": "same", "filters": 8, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_2"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "padding": "same", "filters": 8, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_3"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "same", "name": "max_pooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "max_pooling2d_3"}], "name": "model_1"}, "class_name": "Model", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "model_1"}, {"config": {"input_layers": [["input_2", 0, 0]], "output_layers": [["conv2d_7", 0, 0]], "layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 4, 4, 8], "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_2"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "padding": "same", "filters": 8, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_4"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_1"}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "up_sampling2d_1"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "padding": "same", "filters": 8, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]], "name": "conv2d_5"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_2"}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "up_sampling2d_2"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "padding": "valid", "filters": 16, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]], "name": "conv2d_6"}, {"config": {"trainable": true, "size": [2, 2], "data_format": "channels_last", "name": "up_sampling2d_3"}, "class_name": "UpSampling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "up_sampling2d_3"}, {"config": {"bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "padding": "same", "filters": 1, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]], "name": "conv2d_7"}], "name": "model_2"}, "class_name": "Model", "inbound_nodes": [[["model_1", 1, 0, {}]]], "name": "model_2"}], "input_layers": [["input_1", 0, 0]], "name": "model_3"}, "class_name": "Model", "keras_version": "2.0.1", "backend": "tensorflow"}